#include <iostream>					//Начало
using namespace std;

int main() {
	setlocale(LC_CTYPE, "Russian");
	int n;
	cout << "Введите n=";			//ввод числа n
	cin >> n;
	for (int i = n - 1; i > 0; i--) //от числа n отнимаем 1 и получаем число i
	{
		if (n%i == 0)               //если отстаток от деления на число i равен 0, значит это число является натур. делителем 
		{						//выводим натуральный делитель, если не является пропускаем это число и ищем следующий делитель, отнимая от числа i 1 c каждым новым шагом
			cout << i << endl;  //если i < либо = нулю переходим в конец
		}
	}							// конец
	system("pause");
	return 0;
}