//Задание 2. Написать функцию prost с переменным числом параметров, которая находит все простые числа из не-скольких интервалов. 
//Интервалы задаются границами a и b. С помощью этой функции проверить несколь-ко интервалов.
#include <iostream>

using namespace std;

void prost(int a, ...)
{
	int *p = &a;

	while (*(p + 1))                                  //цикл будет проходить пока не обойдет все заданые интервалы
	{
		for (int i = (*p); i <= *(p + 1); i++)      //переменной присваиваем нижнее значение интервала
		{                                           //далее увеличиваем его на 1 пока не дойдем к верху интервала
			short k = 0;                                //переменная для контроля простое ли число
			for (int j = 2; j <= i; j++)
			{
				if (i % j == 0)                     //если число делиться нацело на другое число в интервале от 2
					k++;                            //до того же,что и это число, то переменную увеличиваем
				if (k > 1)                          //если есть больше 1 числа что делиться нацело на взятое нами
					break;                          //тогда число не являэться простым(на 1 делиться все так что не проверяем)
			}
			if (k == 1)                             //если простое - вывести
				cout << i << " ";
		}
		p += 2;                                     //какбы проскакиваем одно значение,что бы получить нижний интервал следующей строки
		cout << endl;                               //а не верхний предыдущей
		
	}

}

int main()
{
	prost(2, 20, 11, 21, 1, 32);
	cout << endl << "------------------------------------------" << endl;
	prost(8, 13, 5, 29, 6, 11, 3, 5, 25, 43);
	cout << endl << "------------------------------------------" << endl;
	prost(1, 10, 4, 18, 2, 7, 3, 22, 11, 24, 7, 9, 11, 19, 8, 14);
	cout << endl << "------------------------------------------" << endl;


	return 0;
}